In [3]:
import pandas as pd
import numpy as np

In [5]:
s = pd.Series([1,3,6,np.nan,44,1])

In [6]:
print(s)

0     1.0
1     3.0
2     6.0
3     NaN
4    44.0
5     1.0
dtype: float64

In [4]:
dates = pd.date_range('20160101',periods = 6)

In [4]:
dates

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.arange(24).reshape((6,4)),index = dates,columns = ['a','b','c','d'])
#index:行标题，columns:列标题

In [7]:
df

             a   b   c   d
2016-01-01   0   1   2   3
2016-01-02   4   5   6   7
2016-01-03   8   9  10  11
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23

In [12]:
df.dtypes

a    float64
b    float64
c    float64
d    float64
dtype: object

In [13]:
df.index

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [15]:
df.values

array([[-0.77419386, -0.42214678,  0.16104081, -1.11773378],
       [-0.59586365,  0.49056606, -0.07586795, -0.5688461 ],
       [-1.06621661, -0.35066406, -1.13227526,  1.52362602],
       [ 0.83038141,  1.02343822,  0.26231612, -0.67262187],
       [-0.79198019, -0.10563835,  1.08081688, -0.61447576],
       [ 0.52401008, -0.14965502,  0.02040955,  1.01785865]])

In [16]:
df.describe()#只能运算数字，文本之类会直接忽略

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean  -0.312310  0.080983  0.052740 -0.072032
std    0.787067  0.562754  0.711961  1.070444
min   -1.066217 -0.422147 -1.132275 -1.117734
25%   -0.787534 -0.300412 -0.051799 -0.658085
50%   -0.685029 -0.127647  0.090725 -0.591661
75%    0.244042  0.341515  0.236997  0.621182
max    0.830381  1.023438  1.080817  1.523626

In [20]:
df.sort_index(axis = 0,ascending = False)

                   a         b         c         d
2016-01-06  0.524010 -0.149655  0.020410  1.017859
2016-01-05 -0.791980 -0.105638  1.080817 -0.614476
2016-01-04  0.830381  1.023438  0.262316 -0.672622
2016-01-03 -1.066217 -0.350664 -1.132275  1.523626
2016-01-02 -0.595864  0.490566 -0.075868 -0.568846
2016-01-01 -0.774194 -0.422147  0.161041 -1.117734

In [25]:
df

             a   b   c   d
2016-01-01   0   1   2   3
2016-01-02   4   5   6   7
2016-01-03   8   9  10  11
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23

In [30]:
print(df['a'],df.a)#选择数据

2016-01-01     0
2016-01-02     4
2016-01-03     8
2016-01-04    12
2016-01-05    16
2016-01-06    20
Freq: D, Name: a, dtype: int32 2016-01-01     0
2016-01-02     4
2016-01-03     8
2016-01-04    12
2016-01-05    16
2016-01-06    20
Freq: D, Name: a, dtype: int32

In [31]:
print(df[0:3])

            a  b   c   d
2016-01-01  0  1   2   3
2016-01-02  4  5   6   7
2016-01-03  8  9  10  11

In [32]:
#select by loc
print(df.loc['20160102'])

a    4
b    5
c    6
d    7
Name: 2016-01-02 00:00:00, dtype: int32

In [37]:
print(df.loc['2016010':,['a','b']])

             a   b
2016-01-03   8   9
2016-01-04  12  13
2016-01-05  16  17
2016-01-06  20  21

In [38]:
#select by position :iloc
print(df.iloc[3:5,1:3])#按位置索引筛选

             b   c
2016-01-04  13  14
2016-01-05  17  18

In [39]:
#mixed selction :ix 不好用前两个就行
print(df.ix[:3,['a','b']])

            a  b
2016-01-01  0  1
2016-01-02  4  5
2016-01-03  8  9

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [6]:
df.iloc[1,2] = 111

In [7]:
df

             a   b    c   d
2016-01-01   0   1    2   3
2016-01-02   4   5  111   7
2016-01-03   8   9   10  11
2016-01-04  12  13   14  15
2016-01-05  16  17   18  19
2016-01-06  20  21   22  23

In [10]:
df['f'] = [1,2,3,3,3,3]

In [11]:
df

             a   b    c   d  f
2016-01-01   0   1    2   3  1
2016-01-02   4   5  111   7  2
2016-01-03   8   9   10  11  3
2016-01-04  12  13   14  15  3
2016-01-05  16  17   18  19  3
2016-01-06  20  21   22  23  3

In [ ]:
df['e'] = pd.Series([1,2,3,4,5,6], index = pd.date_range('20160101',periods=))

In [8]:
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan

In [10]:
print(df)

             a     b     c   d
2016-01-01   0   NaN   2.0   3
2016-01-02   4   5.0   NaN   7
2016-01-03   8   9.0  10.0  11
2016-01-04  12  13.0  14.0  15
2016-01-05  16  17.0  18.0  19
2016-01-06  20  21.0  22.0  23

In [11]:
print(df.dropna(axis = 0 ,how = 'any'))

             a     b     c   d
2016-01-03   8   9.0  10.0  11
2016-01-04  12  13.0  14.0  15
2016-01-05  16  17.0  18.0  19
2016-01-06  20  21.0  22.0  23

In [17]:
print(df.dropna(axis = 1,how = 'all'))#去除整行都有未知数据的列

             a     b     c   d
2016-01-01   0   NaN   2.0   3
2016-01-02   4   5.0   NaN   7
2016-01-03   8   9.0  10.0  11
2016-01-04  12  13.0  14.0  15
2016-01-05  16  17.0  18.0  19
2016-01-06  20  21.0  22.0  23

In [20]:
print(df.fillna(value = 0))

             a     b     c   d
2016-01-01   0   0.0   2.0   3
2016-01-02   4   5.0   0.0   7
2016-01-03   8   9.0  10.0  11
2016-01-04  12  13.0  14.0  15
2016-01-05  16  17.0  18.0  19
2016-01-06  20  21.0  22.0  23

In [21]:
print(np.any(df.isnull()) == True)#整个数据是否有丢失

True

In [27]:
#read_csv读取文件
data = pd.read_csv('1.csv')

In [1]:
import pandas as pd

In [3]:
studentInfo = pd.read_excel("inputData/16级学生表.xls",skiprows = 1)

In [4]:
studentInfo.head()

        学号   姓名  性别    学院      专业    年级    班级号
0  20160578   卜帅  男  经济学院  国民经济管理  2016  16国经0
1  20160597  李智武  男  经济学院  国民经济管理  2016  16国经0
2  20160661  杨静静  女  经济学院  国民经济管理  2016  16国经0
3  20161207   李莉  女  经济学院  国民经济管理  2016  16国经0
4  20161218  李平平  女  经济学院  国民经济管理  2016  16国经0

In [5]:
studentInfo.index

RangeIndex(start=0, stop=5462, step=1)

In [6]:
studentInfo.columns

Index(['学号 ', '姓名 ', '性别', '学院', '专业', '年级', '班级号'], dtype='object')

In [14]:
studentInfo.sort_values("学号 ",ascending = True).head()

           学号  姓名  性别         学院          专业    年级     班级号
3302  20140471  樊丽  女  财政与公共管理学院         财政学  2016   16财政1
1352  20140629  孙瑞  女       金融学院   金融学（金融实验）  2016   16金实0
3115  20144272  张蕾  女       会计学院  会计学（注册会计学）  2016   16注会3
3162  20144971  屈微  女       会计学院  会计学（注册会计学）  2016   16注会4
1351  20150163  汪燕  女       金融学院         金融学  2016  16金融学9

                学号       年级
count  5.462000e+03  5462.0
mean   2.016274e+07  2016.0
std    1.735036e+03     0.0
min    2.014047e+07  2016.0
25%    2.016138e+07  2016.0
50%    2.016276e+07  2016.0
75%    2.016414e+07  2016.0
max    2.016555e+07  2016.0